API_ID       = айди
API_HASH     = "хэш"
PHONE        = "+номер"
PASSWORD_2FA = "пароль"

MY_ID          = ваш айди
OR_TOKEN       = "опенроутер токен"
OR_MODEL       = "openai/gpt-4o-mini"
OR_API_URL     = "https://openrouter.ai/api/v1/chat/completions"
SCAM_CHANNEL   = "GID_ScamBase"
SESSION_NAME   = "binsave_session"
NOTES_FILE     = "notes.json"
NEWS_CHANNEL   = -1003527894062


BW_CHAT_ID_DEFAULT = -1002664198367

BOT_VERSION = "v1.51"
BOT_NAME    = "Binary Userbot"
CREATOR_ID  = 750545571

CHECK_PING = "⚙️ #binary_ping_check"
CHECK_PONG = "⚙️ #binary_pong:"

LOADING = '<tg-emoji emoji-id="5846038049972031131">😃</tg-emoji> Загружаю...'

EBALAJ_LIMIT = 50

CHANNEL_TO_CHAT = {
    -1001663593743: -1001831286581,
    -1001358614736: -1001436663882,
    -1002444869135: -1002677825346,
    -1002840658463: -1002407997361,
    -1001784967626: -1001679717174,
    -1001225461394: -1001587897897,
    -1001278511445: -1002182242138,
}

EBALAJ_SYSTEM = (
    "Ты — крайне тупой и рассеянный человек по имени Вася. "
    "Ты НИКОГДА не понимаешь собеседника. "
    "Постоянно путаешься, задаёшь нелепые переспросы. "
    "Делаешь абсурдные выводы из слов собеседника. "
    "Иногда отвлекаешься на посторонние темы. "
    "Отвечай ОЧЕНЬ коротко — 1-2 предложения. На русском. "
    "НЕ раскрывай что ты ИИ или бот ни при каких обстоятельствах."
)

TROLL_SYSTEM = (
    "Ты — злой, агрессивный и грубый человек. "
    "Ты общаешься матом, постоянно оскорбляешь собеседника, высмеиваешь его слова. "
    "Дерзишь, провоцируешь, переходишь на личности. "
    "Никогда не помогаешь. Отвечай коротко — 1-3 предложения. "
    "На русском. Используй мат. "
    "НЕ раскрывай что ты ИИ или бот ни при каких обстоятельствах."
)

WMO_CODES = {
    0:"☀️ Ясно", 1:"🌤 Преим. ясно", 2:"⛅ Переменная облачность",
    3:"☁️ Пасмурно", 45:"🌫 Туман", 48:"🌫 Изморозь",
    51:"🌦 Слабая морось", 53:"🌦 Морось", 55:"🌧 Сильная морось",
    61:"🌧 Слабый дождь", 63:"🌧 Дождь", 65:"🌧 Сильный дождь",
    71:"🌨 Слабый снег", 73:"🌨 Снег", 75:"❄️ Сильный снег",
    80:"🌦 Ливень", 81:"🌦 Ливни", 82:"⛈ Сильный ливень",
    95:"⛈ Гроза", 96:"⛈ Гроза с градом", 99:"⛈ Гроза с крупным градом",
}

PROXY_TEXT = (
    '<tg-emoji emoji-id="5258073068852485953">✈️</tg-emoji> <b>Бесплатные MTProto прокси для Telegram</b>\n'
    ' \n'
    '<tg-emoji emoji-id="5274008024585871702">➕</tg-emoji> <b>Сервер 1</b>\n'
    '<code>tg://proxy?server=quackton.life&port=443&secret=ee65fc7553a1f5ca8b50b71c015b38722479616e6465782e7275</code>\n'
    '<tg-emoji emoji-id="5274008024585871702">➕</tg-emoji> <b>Сервер 2</b>\n'
    '<code>tg://proxy?server=mtproto.online&port=443&secret=ee139e0ee36150c1ea3bf299796586b5457777772e7674622e7275</code>\n'
    '<tg-emoji emoji-id="5274008024585871702">➕</tg-emoji> <b>Сервер 3</b>\n'
    '<code>tg://proxy?server=dog.mtproto.online&port=443&secret=eed41d8cd98f00b204e9800998ecf8322e7777772e676c6f676c652e636f6d</code>\n'
    ' \n'
)
